app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
---
SELECT `ideas`.* FROM `ideas` WHERE (`ideas`.`id` = 14) LIMIT 1

  def edit
    @idea = Idea.find(params[:id])
---
SELECT `ideas`.* FROM `ideas` WHERE (`ideas`.`id` = 10) LIMIT 1

  def create
    @idea = Idea.new(params[:idea])

    respond_to do |format|
      if @idea.save
---
INSERT INTO `ideas` (`content`, `color`, `created_at`, `parent_id`, `name`, `updated_at`, `size`, `type`) VALUES ('Targeting 2-4 additional cities', 'green', '2011-02-03 20:11:02', NULL, 'Launch in More Cities', '2011-02-03 20:11:02', NULL, NULL)

  def update
    @idea = Idea.find(params[:id])

    respond_to do |format|
      if @idea.update_attributes(params[:idea])
---
SELECT `ideas`.* FROM `ideas` WHERE (`ideas`.`id` = 14) LIMIT 1
UPDATE `ideas` SET `color` = 'green', `updated_at` = '2011-02-03 20:29:40' WHERE (`ideas`.`id` = 14)

  def update_parent
    @idea = Idea.find(params[:id])
    parent_id = params[:parent_id] == 'undefined' ? nil : params[:parent_id]
    @idea.parent_id = parent_id
    @idea.save!
---
SELECT `ideas`.* FROM `ideas` WHERE (`ideas`.`id` = 5) LIMIT 1
UPDATE `ideas` SET `parent_id` = 10, `updated_at` = '2011-01-28 23:04:45' WHERE (`ideas`.`id` = 5)